# GetTpPl2DCompByStyle

## Description
```pascal
FUNCTION GetTpPl2DCompByStyle(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.GetTpPl2DCompByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2020
## Category
* Objects - Custom